espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_prs.h
/**************************************************************************//**
 * @file
 * @brief EFR32MR21 PRS register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32MR21_PRS_H
#define EFR32MR21_PRS_H
#define PRS_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32MR21_PRS PRS
 * @{
 * @brief EFR32MR21 PRS Register Declaration.
 *****************************************************************************/

/** PRS ASYNC_CH Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< Async Channel Control Register                     */
} PRS_ASYNC_CH_TypeDef;

/** PRS SYNC_CH Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< Sync Channel Control Register                      */
} PRS_SYNC_CH_TypeDef;

/** PRS Register Declaration. */
typedef struct {
  __IM uint32_t        IPVERSION;                     /**< IP version ID                                      */
  uint32_t             RESERVED0[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t       ASYNC_SWPULSE;                 /**< Software Pulse Register                            */
  __IOM uint32_t       ASYNC_SWLEVEL;                 /**< Software Level Register                            */
  __IM uint32_t        ASYNC_PEEK;                    /**< Async Channel Values                               */
  __IM uint32_t        SYNC_PEEK;                     /**< Sync Channel Values                                */
  PRS_ASYNC_CH_TypeDef ASYNC_CH[12U];                 /**< Async Channel registers                            */
  PRS_SYNC_CH_TypeDef  SYNC_CH[4U];                   /**< Sync Channel registers                             */
  __IOM uint32_t       CONSUMER_CMU_CALDN;            /**< CMU CALDN Consumer Selection                       */
  __IOM uint32_t       CONSUMER_CMU_CALUP;            /**< CMU CALUP Consumer Selection                       */
  uint32_t             RESERVED1[1U];                 /**< Reserved for future use                            */
  uint32_t             RESERVED2[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0;     /**< DMAREQ0 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1;     /**< DMAREQ1 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR;       /**< LETIMER CLEAR Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_START;       /**< LETIMER START Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP;        /**< LETIMER STOP Consumer Selection                    */
  __IOM uint32_t       CONSUMER_MODEM_DIN;            /**< MODEM DIN Consumer Selection                       */
  uint32_t             RESERVED3[2U];                 /**< Reserved for future use                            */
  uint32_t             RESERVED4[11U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR;              /**< RAC CLR Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_FORCETX;          /**< RAC FORCETX Consumer Selection                     */
  __IOM uint32_t       CONSUMER_RAC_RXDIS;            /**< RAC RXDIS Consumer Selection                       */
  __IOM uint32_t       CONSUMER_RAC_RXEN;             /**< RAC RXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RAC_SEQ;              /**< RAC SEQ Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_TXEN;             /**< RAC TXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC0;             /**< RTCC CC0 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC1;             /**< RTCC CC1 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC2;             /**< RTCC CC2 Consumer Selection                        */
  uint32_t             RESERVED5[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC0;        /**< SE TAMPERSRC0 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC1;        /**< SE TAMPERSRC1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC2;        /**< SE TAMPERSRC2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC3;        /**< SE TAMPERSRC3 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC4;        /**< SE TAMPERSRC4 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC5;        /**< SE TAMPERSRC5 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC6;        /**< SE TAMPERSRC6 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC7;        /**< SE TAMPERSRC7 Consumer Selection                   */
  uint32_t             RESERVED6[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0;          /**< CTI0 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1;          /**< CTI1 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2;          /**< CTI2 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3;          /**< CTI3 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV;         /**< M33 Consumer Selection                             */
  __IOM uint32_t       CONSUMER_TIMER0_CC0;           /**< TIMER0 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC1;           /**< TIMER0 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC2;           /**< TIMER0 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTI;           /**< TIMER0 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1;        /**< TIMER0 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2;        /**< TIMER0 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_CC0;           /**< TIMER1 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC1;           /**< TIMER1 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC2;           /**< TIMER1 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTI;           /**< TIMER1 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1;        /**< TIMER1 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2;        /**< TIMER1 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_CC0;           /**< TIMER2 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC1;           /**< TIMER2 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC2;           /**< TIMER2 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTI;           /**< TIMER2 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1;        /**< TIMER2 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2;        /**< TIMER2 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_CC0;           /**< TIMER3 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC1;           /**< TIMER3 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC2;           /**< TIMER3 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTI;           /**< TIMER3 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1;        /**< TIMER3 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2;        /**< TIMER3 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_USART0_CLK;           /**< USART0 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART0_IR;            /**< USART0 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_RX;            /**< USART0 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER;       /**< USART0 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART1_CLK;           /**< USART1 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART1_IR;            /**< USART1 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_RX;            /**< USART1 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER;       /**< USART1 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART2_CLK;           /**< USART2 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART2_IR;            /**< USART2 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_RX;            /**< USART2 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_TRIGGER;       /**< USART2 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0;           /**< WDOG0 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1;           /**< WDOG0 SRC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC0;           /**< WDOG1 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC1;           /**< WDOG1 SRC1 Consumer Selection                      */
  uint32_t             RESERVED7[913U];               /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_SET;                 /**< IP version ID                                      */
  uint32_t             RESERVED8[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t       ASYNC_SWPULSE_SET;             /**< Software Pulse Register                            */
  __IOM uint32_t       ASYNC_SWLEVEL_SET;             /**< Software Level Register                            */
  __IM uint32_t        ASYNC_PEEK_SET;                /**< Async Channel Values                               */
  __IM uint32_t        SYNC_PEEK_SET;                 /**< Sync Channel Values                                */
  PRS_ASYNC_CH_TypeDef ASYNC_CH_SET[12U];             /**< Async Channel registers                            */
  PRS_SYNC_CH_TypeDef  SYNC_CH_SET[4U];               /**< Sync Channel registers                             */
  __IOM uint32_t       CONSUMER_CMU_CALDN_SET;        /**< CMU CALDN Consumer Selection                       */
  __IOM uint32_t       CONSUMER_CMU_CALUP_SET;        /**< CMU CALUP Consumer Selection                       */
  uint32_t             RESERVED9[1U];                 /**< Reserved for future use                            */
  uint32_t             RESERVED10[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0_SET; /**< DMAREQ0 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1_SET; /**< DMAREQ1 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR_SET;   /**< LETIMER CLEAR Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_START_SET;   /**< LETIMER START Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP_SET;    /**< LETIMER STOP Consumer Selection                    */
  __IOM uint32_t       CONSUMER_MODEM_DIN_SET;        /**< MODEM DIN Consumer Selection                       */
  uint32_t             RESERVED11[2U];                /**< Reserved for future use                            */
  uint32_t             RESERVED12[11U];               /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR_SET;          /**< RAC CLR Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_FORCETX_SET;      /**< RAC FORCETX Consumer Selection                     */
  __IOM uint32_t       CONSUMER_RAC_RXDIS_SET;        /**< RAC RXDIS Consumer Selection                       */
  __IOM uint32_t       CONSUMER_RAC_RXEN_SET;         /**< RAC RXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RAC_SEQ_SET;          /**< RAC SEQ Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_TXEN_SET;         /**< RAC TXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC0_SET;         /**< RTCC CC0 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC1_SET;         /**< RTCC CC1 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC2_SET;         /**< RTCC CC2 Consumer Selection                        */
  uint32_t             RESERVED13[1U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC0_SET;    /**< SE TAMPERSRC0 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC1_SET;    /**< SE TAMPERSRC1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC2_SET;    /**< SE TAMPERSRC2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC3_SET;    /**< SE TAMPERSRC3 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC4_SET;    /**< SE TAMPERSRC4 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC5_SET;    /**< SE TAMPERSRC5 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC6_SET;    /**< SE TAMPERSRC6 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC7_SET;    /**< SE TAMPERSRC7 Consumer Selection                   */
  uint32_t             RESERVED14[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0_SET;      /**< CTI0 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1_SET;      /**< CTI1 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2_SET;      /**< CTI2 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3_SET;      /**< CTI3 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV_SET;     /**< M33 Consumer Selection                             */
  __IOM uint32_t       CONSUMER_TIMER0_CC0_SET;       /**< TIMER0 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC1_SET;       /**< TIMER0 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC2_SET;       /**< TIMER0 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTI_SET;       /**< TIMER0 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1_SET;    /**< TIMER0 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2_SET;    /**< TIMER0 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_CC0_SET;       /**< TIMER1 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC1_SET;       /**< TIMER1 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC2_SET;       /**< TIMER1 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTI_SET;       /**< TIMER1 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1_SET;    /**< TIMER1 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2_SET;    /**< TIMER1 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_CC0_SET;       /**< TIMER2 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC1_SET;       /**< TIMER2 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC2_SET;       /**< TIMER2 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTI_SET;       /**< TIMER2 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1_SET;    /**< TIMER2 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2_SET;    /**< TIMER2 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_CC0_SET;       /**< TIMER3 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC1_SET;       /**< TIMER3 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC2_SET;       /**< TIMER3 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTI_SET;       /**< TIMER3 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1_SET;    /**< TIMER3 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2_SET;    /**< TIMER3 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_USART0_CLK_SET;       /**< USART0 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART0_IR_SET;        /**< USART0 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_RX_SET;        /**< USART0 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER_SET;   /**< USART0 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART1_CLK_SET;       /**< USART1 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART1_IR_SET;        /**< USART1 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_RX_SET;        /**< USART1 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER_SET;   /**< USART1 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART2_CLK_SET;       /**< USART2 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART2_IR_SET;        /**< USART2 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_RX_SET;        /**< USART2 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_TRIGGER_SET;   /**< USART2 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0_SET;       /**< WDOG0 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1_SET;       /**< WDOG0 SRC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC0_SET;       /**< WDOG1 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC1_SET;       /**< WDOG1 SRC1 Consumer Selection                      */
  uint32_t             RESERVED15[913U];              /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_CLR;                 /**< IP version ID                                      */
  uint32_t             RESERVED16[1U];                /**< Reserved for future use                            */
  __IOM uint32_t       ASYNC_SWPULSE_CLR;             /**< Software Pulse Register                            */
  __IOM uint32_t       ASYNC_SWLEVEL_CLR;             /**< Software Level Register                            */
  __IM uint32_t        ASYNC_PEEK_CLR;                /**< Async Channel Values                               */
  __IM uint32_t        SYNC_PEEK_CLR;                 /**< Sync Channel Values                                */
  PRS_ASYNC_CH_TypeDef ASYNC_CH_CLR[12U];             /**< Async Channel registers                            */
  PRS_SYNC_CH_TypeDef  SYNC_CH_CLR[4U];               /**< Sync Channel registers                             */
  __IOM uint32_t       CONSUMER_CMU_CALDN_CLR;        /**< CMU CALDN Consumer Selection                       */
  __IOM uint32_t       CONSUMER_CMU_CALUP_CLR;        /**< CMU CALUP Consumer Selection                       */
  uint32_t             RESERVED17[1U];                /**< Reserved for future use                            */
  uint32_t             RESERVED18[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0_CLR; /**< DMAREQ0 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1_CLR; /**< DMAREQ1 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR_CLR;   /**< LETIMER CLEAR Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_START_CLR;   /**< LETIMER START Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP_CLR;    /**< LETIMER STOP Consumer Selection                    */
  __IOM uint32_t       CONSUMER_MODEM_DIN_CLR;        /**< MODEM DIN Consumer Selection                       */
  uint32_t             RESERVED19[2U];                /**< Reserved for future use                            */
  uint32_t             RESERVED20[11U];               /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR_CLR;          /**< RAC CLR Consumer Selection                         */
