espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_prs.h
  __IOM uint32_t       CONSUMER_RAC_FORCETX_CLR;      /**< RAC FORCETX Consumer Selection                     */
  __IOM uint32_t       CONSUMER_RAC_RXDIS_CLR;        /**< RAC RXDIS Consumer Selection                       */
  __IOM uint32_t       CONSUMER_RAC_RXEN_CLR;         /**< RAC RXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RAC_SEQ_CLR;          /**< RAC SEQ Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_TXEN_CLR;         /**< RAC TXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC0_CLR;         /**< RTCC CC0 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC1_CLR;         /**< RTCC CC1 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC2_CLR;         /**< RTCC CC2 Consumer Selection                        */
  uint32_t             RESERVED21[1U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC0_CLR;    /**< SE TAMPERSRC0 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC1_CLR;    /**< SE TAMPERSRC1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC2_CLR;    /**< SE TAMPERSRC2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC3_CLR;    /**< SE TAMPERSRC3 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC4_CLR;    /**< SE TAMPERSRC4 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC5_CLR;    /**< SE TAMPERSRC5 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC6_CLR;    /**< SE TAMPERSRC6 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC7_CLR;    /**< SE TAMPERSRC7 Consumer Selection                   */
  uint32_t             RESERVED22[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0_CLR;      /**< CTI0 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1_CLR;      /**< CTI1 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2_CLR;      /**< CTI2 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3_CLR;      /**< CTI3 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV_CLR;     /**< M33 Consumer Selection                             */
  __IOM uint32_t       CONSUMER_TIMER0_CC0_CLR;       /**< TIMER0 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC1_CLR;       /**< TIMER0 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC2_CLR;       /**< TIMER0 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTI_CLR;       /**< TIMER0 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1_CLR;    /**< TIMER0 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2_CLR;    /**< TIMER0 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_CC0_CLR;       /**< TIMER1 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC1_CLR;       /**< TIMER1 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC2_CLR;       /**< TIMER1 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTI_CLR;       /**< TIMER1 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1_CLR;    /**< TIMER1 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2_CLR;    /**< TIMER1 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_CC0_CLR;       /**< TIMER2 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC1_CLR;       /**< TIMER2 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC2_CLR;       /**< TIMER2 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTI_CLR;       /**< TIMER2 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1_CLR;    /**< TIMER2 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2_CLR;    /**< TIMER2 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_CC0_CLR;       /**< TIMER3 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC1_CLR;       /**< TIMER3 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC2_CLR;       /**< TIMER3 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTI_CLR;       /**< TIMER3 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1_CLR;    /**< TIMER3 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2_CLR;    /**< TIMER3 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_USART0_CLK_CLR;       /**< USART0 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART0_IR_CLR;        /**< USART0 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_RX_CLR;        /**< USART0 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER_CLR;   /**< USART0 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART1_CLK_CLR;       /**< USART1 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART1_IR_CLR;        /**< USART1 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_RX_CLR;        /**< USART1 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER_CLR;   /**< USART1 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART2_CLK_CLR;       /**< USART2 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART2_IR_CLR;        /**< USART2 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_RX_CLR;        /**< USART2 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_TRIGGER_CLR;   /**< USART2 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0_CLR;       /**< WDOG0 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1_CLR;       /**< WDOG0 SRC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC0_CLR;       /**< WDOG1 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC1_CLR;       /**< WDOG1 SRC1 Consumer Selection                      */
  uint32_t             RESERVED23[913U];              /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_TGL;                 /**< IP version ID                                      */
  uint32_t             RESERVED24[1U];                /**< Reserved for future use                            */
  __IOM uint32_t       ASYNC_SWPULSE_TGL;             /**< Software Pulse Register                            */
  __IOM uint32_t       ASYNC_SWLEVEL_TGL;             /**< Software Level Register                            */
  __IM uint32_t        ASYNC_PEEK_TGL;                /**< Async Channel Values                               */
  __IM uint32_t        SYNC_PEEK_TGL;                 /**< Sync Channel Values                                */
  PRS_ASYNC_CH_TypeDef ASYNC_CH_TGL[12U];             /**< Async Channel registers                            */
  PRS_SYNC_CH_TypeDef  SYNC_CH_TGL[4U];               /**< Sync Channel registers                             */
  __IOM uint32_t       CONSUMER_CMU_CALDN_TGL;        /**< CMU CALDN Consumer Selection                       */
  __IOM uint32_t       CONSUMER_CMU_CALUP_TGL;        /**< CMU CALUP Consumer Selection                       */
  uint32_t             RESERVED25[1U];                /**< Reserved for future use                            */
  uint32_t             RESERVED26[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0_TGL; /**< DMAREQ0 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1_TGL; /**< DMAREQ1 Consumer Selection                         */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR_TGL;   /**< LETIMER CLEAR Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_START_TGL;   /**< LETIMER START Consumer Selection                   */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP_TGL;    /**< LETIMER STOP Consumer Selection                    */
  __IOM uint32_t       CONSUMER_MODEM_DIN_TGL;        /**< MODEM DIN Consumer Selection                       */
  uint32_t             RESERVED27[2U];                /**< Reserved for future use                            */
  uint32_t             RESERVED28[11U];               /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR_TGL;          /**< RAC CLR Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_FORCETX_TGL;      /**< RAC FORCETX Consumer Selection                     */
  __IOM uint32_t       CONSUMER_RAC_RXDIS_TGL;        /**< RAC RXDIS Consumer Selection                       */
  __IOM uint32_t       CONSUMER_RAC_RXEN_TGL;         /**< RAC RXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RAC_SEQ_TGL;          /**< RAC SEQ Consumer Selection                         */
  __IOM uint32_t       CONSUMER_RAC_TXEN_TGL;         /**< RAC TXEN Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC0_TGL;         /**< RTCC CC0 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC1_TGL;         /**< RTCC CC1 Consumer Selection                        */
  __IOM uint32_t       CONSUMER_RTCC_CC2_TGL;         /**< RTCC CC2 Consumer Selection                        */
  uint32_t             RESERVED29[1U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC0_TGL;    /**< SE TAMPERSRC0 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC1_TGL;    /**< SE TAMPERSRC1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC2_TGL;    /**< SE TAMPERSRC2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC3_TGL;    /**< SE TAMPERSRC3 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC4_TGL;    /**< SE TAMPERSRC4 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC5_TGL;    /**< SE TAMPERSRC5 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC6_TGL;    /**< SE TAMPERSRC6 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_SE_TAMPERSRC7_TGL;    /**< SE TAMPERSRC7 Consumer Selection                   */
  uint32_t             RESERVED30[2U];                /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0_TGL;      /**< CTI0 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1_TGL;      /**< CTI1 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2_TGL;      /**< CTI2 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3_TGL;      /**< CTI3 Consumer Selection                            */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV_TGL;     /**< M33 Consumer Selection                             */
  __IOM uint32_t       CONSUMER_TIMER0_CC0_TGL;       /**< TIMER0 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC1_TGL;       /**< TIMER0 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_CC2_TGL;       /**< TIMER0 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTI_TGL;       /**< TIMER0 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1_TGL;    /**< TIMER0 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2_TGL;    /**< TIMER0 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_CC0_TGL;       /**< TIMER1 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC1_TGL;       /**< TIMER1 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_CC2_TGL;       /**< TIMER1 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTI_TGL;       /**< TIMER1 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1_TGL;    /**< TIMER1 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2_TGL;    /**< TIMER1 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_CC0_TGL;       /**< TIMER2 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC1_TGL;       /**< TIMER2 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_CC2_TGL;       /**< TIMER2 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTI_TGL;       /**< TIMER2 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1_TGL;    /**< TIMER2 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2_TGL;    /**< TIMER2 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_CC0_TGL;       /**< TIMER3 CC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC1_TGL;       /**< TIMER3 CC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_CC2_TGL;       /**< TIMER3 CC2 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTI_TGL;       /**< TIMER3 DTI Consumer Selection                      */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1_TGL;    /**< TIMER3 DTIFS1 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2_TGL;    /**< TIMER3 DTIFS2 Consumer Selection                   */
  __IOM uint32_t       CONSUMER_USART0_CLK_TGL;       /**< USART0 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART0_IR_TGL;        /**< USART0 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_RX_TGL;        /**< USART0 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER_TGL;   /**< USART0 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART1_CLK_TGL;       /**< USART1 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART1_IR_TGL;        /**< USART1 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_RX_TGL;        /**< USART1 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER_TGL;   /**< USART1 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_USART2_CLK_TGL;       /**< USART2 CLK Consumer Selection                      */
  __IOM uint32_t       CONSUMER_USART2_IR_TGL;        /**< USART2 IR Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_RX_TGL;        /**< USART2 RX Consumer Selection                       */
  __IOM uint32_t       CONSUMER_USART2_TRIGGER_TGL;   /**< USART2 TRIGGER Consumer Selection                  */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0_TGL;       /**< WDOG0 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1_TGL;       /**< WDOG0 SRC1 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC0_TGL;       /**< WDOG1 SRC0 Consumer Selection                      */
  __IOM uint32_t       CONSUMER_WDOG1_SRC1_TGL;       /**< WDOG1 SRC1 Consumer Selection                      */
} PRS_TypeDef;
/** @} End of group EFR32MR21_PRS */

/**************************************************************************//**
 * @addtogroup EFR32MR21_PRS
 * @{
 * @defgroup EFR32MR21_PRS_BitFields PRS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for PRS IPVERSION */
#define _PRS_IPVERSION_RESETVALUE                        0x00000000UL                            /**< Default value for PRS_IPVERSION             */
#define _PRS_IPVERSION_MASK                              0xFFFFFFFFUL                            /**< Mask for PRS_IPVERSION                      */
#define _PRS_IPVERSION_IPVERSION_SHIFT                   0                                       /**< Shift value for PRS_IPVERSION               */
#define _PRS_IPVERSION_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Bit mask for PRS_IPVERSION                  */
#define _PRS_IPVERSION_IPVERSION_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for PRS_IPVERSION              */
#define PRS_IPVERSION_IPVERSION_DEFAULT                  (_PRS_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_IPVERSION      */

