espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_prs.h
/* Bit fields for PRS CONSUMER_RTCC_CC1 */
#define _PRS_CONSUMER_RTCC_CC1_RESETVALUE                0x00000000UL                                 /**< Default value for PRS_CONSUMER_RTCC_CC1     */
#define _PRS_CONSUMER_RTCC_CC1_MASK                      0x0000000FUL                                 /**< Mask for PRS_CONSUMER_RTCC_CC1              */
#define _PRS_CONSUMER_RTCC_CC1_PRSSEL_SHIFT              0                                            /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_RTCC_CC1_PRSSEL_MASK               0xFUL                                        /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_RTCC_CC1_PRSSEL_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PRS_CONSUMER_RTCC_CC1      */
#define PRS_CONSUMER_RTCC_CC1_PRSSEL_DEFAULT             (_PRS_CONSUMER_RTCC_CC1_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_RTCC_CC1*/

/* Bit fields for PRS CONSUMER_RTCC_CC2 */
#define _PRS_CONSUMER_RTCC_CC2_RESETVALUE                0x00000000UL                                 /**< Default value for PRS_CONSUMER_RTCC_CC2     */
#define _PRS_CONSUMER_RTCC_CC2_MASK                      0x0000000FUL                                 /**< Mask for PRS_CONSUMER_RTCC_CC2              */
#define _PRS_CONSUMER_RTCC_CC2_PRSSEL_SHIFT              0                                            /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_RTCC_CC2_PRSSEL_MASK               0xFUL                                        /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_RTCC_CC2_PRSSEL_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PRS_CONSUMER_RTCC_CC2      */
#define PRS_CONSUMER_RTCC_CC2_PRSSEL_DEFAULT             (_PRS_CONSUMER_RTCC_CC2_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_RTCC_CC2*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC0 */
#define _PRS_CONSUMER_SE_TAMPERSRC0_RESETVALUE           0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC0*/
#define _PRS_CONSUMER_SE_TAMPERSRC0_MASK                 0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC0         */
#define _PRS_CONSUMER_SE_TAMPERSRC0_PRSSEL_SHIFT         0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC0_PRSSEL_MASK          0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC0_PRSSEL_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC0 */
#define PRS_CONSUMER_SE_TAMPERSRC0_PRSSEL_DEFAULT        (_PRS_CONSUMER_SE_TAMPERSRC0_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC0*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC1 */
#define _PRS_CONSUMER_SE_TAMPERSRC1_RESETVALUE           0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC1*/
#define _PRS_CONSUMER_SE_TAMPERSRC1_MASK                 0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC1         */
#define _PRS_CONSUMER_SE_TAMPERSRC1_PRSSEL_SHIFT         0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC1_PRSSEL_MASK          0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC1_PRSSEL_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC1 */
#define PRS_CONSUMER_SE_TAMPERSRC1_PRSSEL_DEFAULT        (_PRS_CONSUMER_SE_TAMPERSRC1_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC1*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC2 */
#define _PRS_CONSUMER_SE_TAMPERSRC2_RESETVALUE           0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC2*/
#define _PRS_CONSUMER_SE_TAMPERSRC2_MASK                 0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC2         */
#define _PRS_CONSUMER_SE_TAMPERSRC2_PRSSEL_SHIFT         0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC2_PRSSEL_MASK          0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC2_PRSSEL_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC2 */
#define PRS_CONSUMER_SE_TAMPERSRC2_PRSSEL_DEFAULT        (_PRS_CONSUMER_SE_TAMPERSRC2_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC2*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC3 */
#define _PRS_CONSUMER_SE_TAMPERSRC3_RESETVALUE           0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC3*/
#define _PRS_CONSUMER_SE_TAMPERSRC3_MASK                 0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC3         */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_SHIFT         0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_MASK          0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC3 */
#define PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT        (_PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC3*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC4 */
#define _PRS_CONSUMER_SE_TAMPERSRC4_RESETVALUE           0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC4*/
#define _PRS_CONSUMER_SE_TAMPERSRC4_MASK                 0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC4         */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_SHIFT         0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_MASK          0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC4 */
#define PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT        (_PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC4*/

